{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"ZeroPadding2D","config":{"padding":[[0,0],[4,4]],"data_format":"channels_last","name":"zero_padding2d_ZeroPadding2D1","trainable":true,"batch_input_shape":[null,8,201,1],"dtype":"float32"}},{"class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,9],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true}},{"class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true}},{"class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true}},{"class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D8","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization8","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D9","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization9","trainable":true}},{"class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D10","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization10","trainable":true}},{"class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D11","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization11","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D12","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization12","trainable":true}},{"class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D13","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization13","trainable":true}},{"class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D14","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization14","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization15","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[201,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D16","trainable":true}}],"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./noise_model_name.weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[8,9,1,18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[18],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,5,18,30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[30],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[1,9,30,8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[1,9,8,18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[18],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[1,5,18,30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[30],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[1,9,30,8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[1,9,8,18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[18],"dtype":"float32"},{"name":"conv2d_Conv2D8/kernel","shape":[1,5,18,30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/gamma","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/beta","shape":[30],"dtype":"float32"},{"name":"conv2d_Conv2D9/kernel","shape":[1,9,30,8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D10/kernel","shape":[1,9,8,18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/gamma","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/beta","shape":[18],"dtype":"float32"},{"name":"conv2d_Conv2D11/kernel","shape":[1,5,18,30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/gamma","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/beta","shape":[30],"dtype":"float32"},{"name":"conv2d_Conv2D12/kernel","shape":[1,9,30,8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D13/kernel","shape":[1,9,8,18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/gamma","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/beta","shape":[18],"dtype":"float32"},{"name":"conv2d_Conv2D14/kernel","shape":[1,5,18,30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/gamma","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/beta","shape":[30],"dtype":"float32"},{"name":"conv2d_Conv2D15/kernel","shape":[1,9,30,8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D16/kernel","shape":[201,1,8,1],"dtype":"float32"},{"name":"conv2d_Conv2D16/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_mean","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_variance","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_mean","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_variance","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_mean","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_variance","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_mean","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_variance","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_mean","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_variance","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_variance","shape":[8],"dtype":"float32"}]}]}