{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"ZeroPadding2D","config":{"padding":[[0,0],[4,4]],"data_format":"channels_last","name":"zero_padding2d_ZeroPadding2D1","trainable":true,"batch_input_shape":[null,8,201,1],"dtype":"float32"}},{"class_name":"Conv2D","config":{"filters":18,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,9],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[201,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true}}],"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./noise_model_name.weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[8,9,1,18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[18],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,5,18,30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[30],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[1,9,30,8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[201,1,8,1],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[30],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[8],"dtype":"float32"}]}]}